// - 变量-单个变量

// - 变量-多个变量

// - 基本类型-字符串

// - 基本类型-数字

// - 基本类型-布尔值

// - 数组-定义

// - 数组-获取长度

// - 数组-遍历

// - 数组-截取

// - 数组-连接

// - Map-创建

// - Map-设置

// - Map-长度

// - Map-读取

// - Map-删除

// - Map-遍历

// - 结构-定义

// - 结构-获取属性值

// - 正则表达式-定义

// - 正则表达式-是否匹配

// - 正则表达式-匹配结果

// - 循环-for

// - 循环-while

// - 选择-switch

// - 方法-普通方法

// - 方法-匿名方法

// - 方法-IIFE

// - 类-声明

// - 类-继承

// - 类-实例化

// - JSON-定义

// - JSON-编码

// - JSON-解码

// - 时间-当前时间戳

// - 时间-获取时间

// - 系统变量-当前代码文件

// - 系统变量-当前代码目录

// - 系统变量-进程启动路径

// - 系统变量-环境变量

// - 系统变量-启动时入参

// - 系统变量-当前进程id

// - 系统变量-退出进程

// - 系统变量-输出